Converting a csv file to a DataFrame

In [9]:
import pandas as pd
titanic = pd.read_csv('titanic.csv')
print(type (titanic))
print(titanic.head(20))

print(titanic.info())
print(titanic.describe())

<class 'pandas.core.frame.DataFrame'>
    PassengerId  Survived  Pclass  \
0             1         0       3
1             2         1       1
2             3         1       3
3             4         1       1
4             5         0       3
5             6         0       3
6             7         0       1
7             8         0       3
8             9         1       3
9            10         1       2
10           11         1       3
11           12         1       1
12           13         0       3
13           14         0       3
14           15         0       3
15           16         1       2
16           17         0       3
17           18         1       2
18           19         0       3
19           20         1       3

                                                 Name     Sex   Age  SibSp  \
0                             Braund, Mr. Owen Harris    male  22.0      1
1   Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                              Heikkinen, Miss. Laina  female  26.0      0
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                            Allen, Mr. William Henry    male  35.0      0
5                                    Moran, Mr. James    male   NaN      0
6                             McCarthy, Mr. Timothy J    male  54.0      0
7                      Palsson, Master. Gosta Leonard    male   2.0      3
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                 Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
10                    Sandstrom, Miss. Marguerite Rut  female   4.0      1
11                           Bonnell, Miss. Elizabeth  female  58.0      0
12                     Saundercock, Mr. William Henry    male  20.0      0
13                        Andersson, Mr. Anders Johan    male  39.0      1
14               Vestrom, Miss. Hulda Amanda Adolfina  female  14.0      0
15                   Hewlett, Mrs. (Mary D Kingcome)   female  55.0      0
16                               Rice, Master. Eugene    male   2.0      4
17                       Williams, Mr. Charles Eugene    male   NaN      0
18  Vander Planke, Mrs. Julius (Emelia Maria Vande...  female  31.0      1
19                            Masselmani, Mrs. Fatima  female   NaN      0

    Parch            Ticket     Fare Cabin Embarked
0       0         A/5 21171   7.2500   NaN        S
1       0          PC 17599  71.2833   C85        C
2       0  STON/O2. 3101282   7.9250   NaN        S
3       0            113803  53.1000  C123        S
4       0            373450   8.0500   NaN        S
5       0            330877   8.4583   NaN        Q
6       0             17463  51.8625   E46        S
7       1            349909  21.0750   NaN        S
8       2            347742  11.1333   NaN        S
9       0            237736  30.0708   NaN        C
10      1           PP 9549  16.7000    G6        S
11      0            113783  26.5500  C103        S
12      0         A/5. 2151   8.0500   NaN        S
13      5            347082  31.2750   NaN        S
14      0            350406   7.8542   NaN        S
15      0            248706  16.0000   NaN        S
16      1            382652  29.1250   NaN        Q
17      0            244373  13.0000   NaN        S
18      0            345763  18.0000   NaN        S
19      0              2649   7.2250   NaN        C
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None
       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

skiprows

In [10]:
import pandas as pd
titanic = pd.read_csv('titanic.csv', skiprows=2)
#print(type (titanic))
print(titanic.head(5))

   2  1  1.1 Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  \
0  3  1    3                             Heikkinen, Miss. Laina   female
1  4  1    1       Futrelle, Mrs. Jacques Heath (Lily May Peel)   female
2  5  0    3                           Allen, Mr. William Henry     male
3  6  0    3                                   Moran, Mr. James     male
4  7  0    1                            McCarthy, Mr. Timothy J     male

     38  1.2  0          PC 17599  71.2833   C85  C
0  26.0    0  0  STON/O2. 3101282   7.9250   NaN  S
1  35.0    1  0            113803  53.1000  C123  S
2  35.0    0  0            373450   8.0500   NaN  S
3   NaN    0  0            330877   8.4583   NaN  Q
4  54.0    0  0             17463  51.8625   E46  S

header

In [11]:
import pandas as pd
titanic = pd.read_csv('titanic.csv', header=2)
#print(type (titanic))
print(titanic.head(5))

   2  1  1.1 Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  \
0  3  1    3                             Heikkinen, Miss. Laina   female
1  4  1    1       Futrelle, Mrs. Jacques Heath (Lily May Peel)   female
2  5  0    3                           Allen, Mr. William Henry     male
3  6  0    3                                   Moran, Mr. James     male
4  7  0    1                            McCarthy, Mr. Timothy J     male

     38  1.2  0          PC 17599  71.2833   C85  C
0  26.0    0  0  STON/O2. 3101282   7.9250   NaN  S
1  35.0    1  0            113803  53.1000  C123  S
2  35.0    0  0            373450   8.0500   NaN  S
3   NaN    0  0            330877   8.4583   NaN  Q
4  54.0    0  0             17463  51.8625   E46  S

In [12]:
import pandas as pd
titanic = pd.read_csv('titanic.csv', header=None, names=['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k'])
print(titanic.head(2))

                    a       b                        c     d    e      f  \
PassengerId  Survived  Pclass                     Name   Sex  Age  SibSp
1                   0       3  Braund, Mr. Owen Harris  male   22      1

                 g          h     i      j         k
PassengerId  Parch     Ticket  Fare  Cabin  Embarked
1                0  A/5 21171  7.25    NaN         S

index_col

In [13]:
import pandas as pd
titanic = pd.read_csv('titanic.csv', index_col='Name')
#print(type (titanic))
print(titanic.head(2))

                                                    PassengerId  Survived  \
Name
Braund, Mr. Owen Harris                                       1         0
Cumings, Mrs. John Bradley (Florence Briggs Tha...            2         1

                                                    Pclass     Sex   Age  \
Name
Braund, Mr. Owen Harris                                  3    male  22.0
Cumings, Mrs. John Bradley (Florence Briggs Tha...       1  female  38.0

                                                    SibSp  Parch     Ticket  \
Name
Braund, Mr. Owen Harris                                 1      0  A/5 21171
Cumings, Mrs. John Bradley (Florence Briggs Tha...      1      0   PC 17599

                                                       Fare Cabin Embarked
Name
Braund, Mr. Owen Harris                              7.2500   NaN        S
Cumings, Mrs. John Bradley (Florence Briggs Tha...  71.2833   C85        C

NBA ALL

In [14]:
import pandas as pd 
df = pd.read_excel('all_seasons.xlsx', sheet_name = 0, header = 0)
print(df.head())

   Unnamed: 0       player_name team_abbreviation  age  player_height  \
0           0  Randy Livingston               HOU   22         193.04
1           1  Gaylon Nickerson               WAS   28         190.50
2           2      George Lynch               VAN   26         203.20
3           3    George McCloud               LAL   30         203.20
4           4      George Zidek               DEN   23         213.36

   player_weight                college country draft_year draft_round  ...  \
0      94.800728        Louisiana State     USA       1996           2  ...
1      86.182480  Northwestern Oklahoma     USA       1994           2  ...
2     103.418976         North Carolina     USA       1993           1  ...
3     102.058200          Florida State     USA       1989           1  ...
4     119.748288                   UCLA     USA       1995           1  ...

    pts  reb  ast  net_rating  oreb_pct  dreb_pct  usg_pct  ts_pct  ast_pct  \
0   3.9  1.5  2.4         0.3     0.042     0.071    0.169   0.487    0.248
1   3.8  1.3  0.3         8.9     0.030     0.111    0.174   0.497    0.043
2   8.3  6.4  1.9        -8.2     0.106     0.185    0.175   0.512    0.125
3  10.2  2.8  1.7        -2.7     0.027     0.111    0.206   0.527    0.125
4   2.8  1.7  0.3       -14.1     0.102     0.169    0.195   0.500    0.064

    season
0  1996-97
1  1996-97
2  1996-97
3  1996-97
4  1996-97

[5 rows x 22 columns]

JSON

In [15]:
import pandas as pd 
import matplotlib.pyplot as plt

df = pd.read_json('universities_ranking.json', orient='records')

print(df.head())

   world_rank                            institution         country  \
0           1                     Harvard University             USA
1           2  Massachusetts Institute of Technology             USA
2           3                    Stanford University             USA
3           4                University of Cambridge  United Kingdom
4           5     California Institute of Technology             USA

   national_rank  quality_of_education  alumni_employment  quality_of_faculty  \
0              1                     7                  9                   1
1              2                     9                 17                   3
2              3                    17                 11                   5
3              1                    10                 24                   4
4              4                     2                 29                   7

   publications  influence  citations broad_impact  patents   score  year
0             1          1          1                     5  100.00  2012
1            12          4          4                     1   91.67  2012
2             4          2          2                    15   89.50  2012
3            16         16         11                    50   86.17  2012
4            37         22         22                    18   85.21  2012

DataReader API

In [16]:
%%apt install python3-pandas-DataReader
import pandas_datareader as pdr
from pandas_datareader import wb

all_indicators = pdr.wb.get_indicators()

print(all_indicators.iloc[:5, :2])

UsageError: Cell magic `%%apt` not found.

DataReader API

In [ ]:
import matplotlib.pyplot as plt
from pandas_datareader import wb

all_indicators = pdr.wb.get_indicators()
print(all_indicators.iloc[:5, :2])

ModuleNotFoundError: No module named 'pandas_datareader'

Manipulating Rows, Columns and Elements in a DataFrame

delete rows

In [ ]:
import pandas as pd 
import matplotlib.pyplot as plt

df = pd.read_json('universities_ranking.json', orient='records')

#print(df.info())
#print(df.head())
print(df.drop([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10], axis = 0, inplace = False))

      world_rank                                      institution  \
11            12                               Cornell University
12            13                       University of Pennsylvania
13            14                              University of Tokyo
14            15                         Johns Hopkins University
15            16  Swiss Federal Institute of Technology in Zurich
...          ...                                              ...
2195         996                        University of the Algarve
2196         997                            Alexandria University
2197         998                     Federal University of CearÃ¡
2198         999                          University of A CoruÃ±a
2199        1000                  China Pharmaceutical University

          country  national_rank  quality_of_education  alumni_employment  \
11            USA             10                    21                 42
12            USA             11                    31                 16
13          Japan              1                    32                 19
14            USA             12                    34                 77
15    Switzerland              1                    26                 66
...           ...            ...                   ...                ...
2195     Portugal              7                   367                567
2196        Egypt              4                   236                566
2197       Brazil             18                   367                549
2198        Spain             40                   367                567
2199        China             83                   367                567

      quality_of_faculty  publications  influence  citations broad_impact  \
11                    14            22         21         16
12                    24             9         10          8
13                    31             8         19         23
14                    20            11          9          9
15                    11            40         51         44
...                  ...           ...        ...        ...          ...
2195                 218           926        845        812          969
2196                 218           997        908        645          981
2197                 218           830        823        812          975
2198                 218           886        974        812          975
2199                 218           861        991        812          981

      patents  score  year
11         10  73.69  2012
12          9  73.64  2012
13          3  69.49  2012
14          7  66.94  2012
15         34  66.69  2012
...       ...    ...   ...
2195      816  44.03  2015
2196      871  44.03  2015
2197      824  44.03  2015
2198      651  44.02  2015
2199      547  44.02  2015

[2189 rows x 14 columns]

delete column

In [ ]:
import pandas as pd 
import matplotlib.pyplot as plt

df = pd.read_json('universities_ranking.json', orient='records')
print(df.drop(["national_rank", "alumni_employment"], axis = 1, inplace = False))

      world_rank                            institution         country  \
0              1                     Harvard University             USA
1              2  Massachusetts Institute of Technology             USA
2              3                    Stanford University             USA
3              4                University of Cambridge  United Kingdom
4              5     California Institute of Technology             USA
...          ...                                    ...             ...
2195         996              University of the Algarve        Portugal
2196         997                  Alexandria University           Egypt
2197         998           Federal University of CearÃ¡          Brazil
2198         999                University of A CoruÃ±a           Spain
2199        1000        China Pharmaceutical University           China

      quality_of_education  quality_of_faculty  publications  influence  \
0                        7                   1             1          1
1                        9                   3            12          4
2                       17                   5             4          2
3                       10                   4            16         16
4                        2                   7            37         22
...                    ...                 ...           ...        ...
2195                   367                 218           926        845
2196                   236                 218           997        908
2197                   367                 218           830        823
2198                   367                 218           886        974
2199                   367                 218           861        991

      citations broad_impact  patents   score  year
0             1                     5  100.00  2012
1             4                     1   91.67  2012
2             2                    15   89.50  2012
3            11                    50   86.17  2012
4            22                    18   85.21  2012
...         ...          ...      ...     ...   ...
2195        812          969      816   44.03  2015
2196        645          981      871   44.03  2015
2197        812          975      824   44.03  2015
2198        812          975      651   44.02  2015
2199        812          981      547   44.02  2015

[2200 rows x 12 columns]

loc and iloc
selecting row

In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

rank = pd.read_json('universities_ranking.json', orient = 'records')

index_position = rank.iloc[1:10]
index_position

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
1,2,Massachusetts Institute of Technology,USA,2,9,17,3,12,4,4,,1,91.67,2012
2,3,Stanford University,USA,3,17,11,5,4,2,2,,15,89.50,2012
3,4,University of Cambridge,United Kingdom,1,10,24,4,16,16,11,,50,86.17,2012
4,5,California Institute of Technology,USA,4,2,29,7,37,22,22,,18,85.21,2012
5,6,Princeton University,USA,5,8,14,2,53,33,26,,101,82.50,2012
6,7,University of Oxford,United Kingdom,2,13,28,9,15,13,19,,26,82.34,2012
7,8,Yale University,USA,6,14,31,12,14,6,15,,66,79.14,2012
8,9,Columbia University,USA,7,23,21,10,13,12,14,,5,78.86,2012
9,10,"University of California, Berkeley",USA,8,16,52,6,6,5,3,,16,78.55,2012

SPOTIFY ANALYSIS

In [ ]:
# Step 1
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

song = pd.read_csv('spotify_global_2019_most_streamed_tracks_audio_features.csv')
print(song.head())

ModuleNotFoundError: No module named 'seaborn'